love_black_backend/app/controllers/comments_controller.rb

    def create
        #comment = Comment.find(params[:post_id])
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("text", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "can i comment"], ["post_id", 89], ["created_at", "2020-07-10 16:08:59.389821"], ["updated_at", "2020-07-10 16:08:59.389821"]]