love_black_backend/app/controllers/posts_controller.rb

    def show
        post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def create
        post = Post.new(post_params)
        if post.save
---
INSERT INTO "posts" ("content", "state", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Juneteenth needs to become a national holiday"], ["state", "California"], ["country", "US"], ["created_at", "2020-07-05 07:52:52.734621"], ["updated_at", "2020-07-05 07:52:52.734621"]]

    def update
        post = Post.find(params[:id])
        if post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "I want police brutality to stop, Missouri, US, 3 likes"], ["updated_at", "2020-06-14 19:32:53.879522"], ["id", 1]]

    def destroy
        post = Post.find(params[:id])
        post.comments.each { |comment| comment.delete }
        post.delete
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 84]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 40]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 76], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 40]]